org/core-new.org
** Configuration
Also using dynaconf for configuration.

#+begin_src python :tangle (my/org-prj-dir "sqrt_data_agent/api/config.py")
import os

from dynaconf import Dynaconf

__all__ = ['settings']

settings_files = [
    os.path.expanduser('~/.config/sqrt-data/config.agent.toml'),
    'config.agent.toml'
]

if all([not os.path.exists(f) for f in settings_files]):
    print('No config found!')

settings = Dynaconf(settings_files=settings_files)
#+end_src

#+begin_src conf-toml :tangle (my/org-prj-dir "config.agent.toml")
dynaconf_merge = true

[general]
root = '@format {env[HOME]}/logs-sync-debug'

[mpd]
log_folder = '@format {this.general.root}/mpd/logs'
library_csv = '@format {this.general.root}/mpd/mpd_library.csv'
exception_timeout = 5
exception_count = 10
listened_threshold = 0.5
custom_attrs = ['musicbrainz_albumid', 'musicbrainz_artistid', 'musicbrainz_trackid']

[aw]
last_updated = '@format {this.general.root}/aw_last_updated.json'
logs_folder = '@format {this.general.root}/aw'
types = ['afkstatus', 'currentwindow', 'web.tab.current', 'app.editor.activity']
api = 'http://localhost:5600/api'

[sync]
log_file = '@format {this.general.root}/sync.log'
target = 'ssh://pavel@sqrtminusone.xyz//home/pavel/logs-sync'
#+end_src

** Sync
:PROPERTIES:
:header-args:python+: :tangle (my/org-prj-dir "sqrt_data_agent/sync.py")
:END:
Synchronizing the =logs-sync= folder between client machines and the server.

Previously, this was a bash script, but I've converted in to Python for Guix packaging purposes.

I use [[https://github.com/deajan/osync][osync]] as the sync engine. I even made a [[https://github.com/SqrtMinusOne/channel-q/blob/master/osync.scm][Guix package definition]], although didn't submit it yet.

#+begin_src python
import argparse
import os
import subprocess
import socket
from datetime import datetime

from sqrt_data_agent.api import settings
from .aw import save_buckets
from .mpd_save_library import save_library
#+end_src

All the dependencies are written down like this to make packaging easier:
#+begin_src python
EXEC_OSYNC = 'osync.sh'
EXEC_NOTIFY_SEND = 'notify-send'
#+end_src
The idea is that the names will be replaced by full paths in the Guix recipe.

I want the sync run only once a day on a given hostname. To do that, I write the following string to the =sync.log_file= after a successful synchronization:

#+begin_src python
def log_string():
    date_string = datetime.strftime(datetime.now(), "%Y-%m-%d")
    return f'{socket.gethostname()}: {date_string}'
#+end_src

Check if that string exists in the file:
#+begin_src python
def check_today_sync():
    if not os.path.exists(settings.sync.log_file):
        return False
    string = log_string()
    with open(settings.sync.log_file, 'r') as f:
        for line in f:
            if line.strip() == string:
                return True
    return False
#+end_src

And append that string to the file:
#+begin_src python
def set_today_sync():
    with open(settings.sync.log_file, 'a') as f:
        f.write(log_string() + '\n')
#+end_src

Now, performing the actual sync.
#+begin_src python
def sync_logs(force=False):
    if not force and check_today_sync():
        print('Already synced today!')
        return
    save_library()
    save_buckets(force)
    subprocess.run(
        [
            EXEC_OSYNC, f'--initiator={settings.general.root}',
            f'--target={settings.sync.target}'
        ],
        env={
            **os.environ,
            'RSYNC_EXCLUDE_PATTERN': 'sync.log',
            'CREATE_DIRS': 'yes',
            'REMOTE_HOST_PING': 'false',
            'PATH': os.environ['PATH']
        },
        check=True
    )
    subprocess.run(
        [EXEC_NOTIFY_SEND, 'Sync', 'Logs submitted to the server'],
        env={'DISPLAY': ':0', **os.environ}
    )
    set_today_sync()
#+end_src

And a simple CLI with =argparse=:
#+begin_src python
def main():
    parser = argparse.ArgumentParser(
        prog='sqrt_data_agent.aw'
    )
    parser.add_argument('-f', '--force', action='store_true')
    args = parser.parse_args()
    sync_logs(args.force)

if __name__ == '__main__':
    main()
#+end_src

* Deploy & Usage
** Python setup
*** Requirements
Requirements for =sqrt_data_service=:
#+begin_src text :tangle (my/org-prj-dir "requirements.txt")
dynaconf==3.1.11
sqlalchemy==1.4.44
psycopg2-binary
alembic
click==8.1.3
furl==2.1.3
tldextract==3.4.0
pandas==1.5.1
numpy==1.23.4
tqdm==4.64.1
beautifulsoup4==4.11.1
python-dateutil==2.8.2
#+end_src
*** setup.py for agent
#+begin_src python :tangle (my/org-prj-dir "setup.py")
from setuptools import find_packages, setup

setup(
    name='sqrt_data_agent',
    version='3.0.0',
    description='Agent for sqrt-data',
    author='SqrtMinusOne',
    author_email='thexcloud@gmail.com',
    packages=find_packages(exclude=['sqrt_data_service']),
    install_requires=[
        'pandas>=1.4.2',
        'numpy>=1.21.6',
        'requests>=2.27.1',
        'furl>=2.1.3',
        'dynaconf>=3.1.7',
        'python-mpd2>=3.0.4',
        'python-dateutil>=2.8.2',
    ],
    entry_points='''
    [console_scripts]
    sqrt_data_agent_mpd=sqrt_data_agent.mpd:main
    sqrt_data_agent_sync=sqrt_data_agent.sync:main
    '''
)
#+end_src
** Guix setup
This part is largely inspired by the build setup of the Nyxt browser.

This concerns only the agent, as I don't use Guix on the server yet. Packaging prefect for Guix would be a pain anyway.

*** Usage
To make a development environment, run:
#+begin_src bash :eval no
guix shell --container -D -f sqrt-data-agent.scm --share=$HOME/logs-sync
#+end_src
This will create an environment with all the dependencies, but not the =sqrt_data_agent= package itself.

To create an environment with the package, remove the =-D= flag:
#+begin_src bash :eval no
guix shell --container -f sqrt-data-agent.scm --share=$HOME/logs-sync
#+end_src

One issue with the container is that the app may not have access to stuff outside the container, like the MPD socket. If such access is necessary, remove the =--container= flag.
#+begin_src bash :eval no
guix shell -f sqrt-data-agent.scm
#+end_src

